<H3>Objectives<H3>

After completing this lab, you will be able to:

- Use joins to query data from multiple tables

- Create and query views

- Write and run stored procedures

- Use transactions

<H3>Scenario<H3>

In this project, you will work with three datasets that are available on the City of Chicago's Data Portal:

- Socioeconomic indicators in Chicago

- Chicago public schools

- Chicago crime data
You must download each dataset, create a table for each one, and load the appropiate dataset through the Db2 console. If you have already completed the Hands on Lab: Joins, you can reuse the tables you created for that hands-on lab. However, you should not reuse similar tables with other names from other exercises or labs, as they may not create the correct results.

<H4>Important note:

If you have not yet downloaded the three datasets from the City of Chicago's Data Portal, created the required tables, and loaded the data, please follow the instructions in this section.

<H3>City of Chicago Datasets<h3>
Socioeconomic indicators in Chicago
This dataset contains a selection of six socioeconomic indicators of public health significance and a “hardship index,” for each Chicago community area, for the years 2008 – 2012. A detailed description of this dataset and the original dataset can be obtained from the Chicago Data Portal at: https://data.cityofchicago.org/Health-Human-Services/Census-Data-Selected-socioeconomic-indicators-in-C/kn9c-c2s2

Chicago public schools :
This dataset shows all school level performance data used to create CPS School Report Cards for the 2011-2012 school year. A detailed description of this dataset and the original dataset can be obtained from the Chicago Data Portal at: https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t

Chicago crime data :
This dataset reflects reported incidents of crime (with the exception of murders where data exists for each victim) that occurred in the City of Chicago from 2001 to present, minus the most recent seven days. A detailed description of this dataset and the original dataset can be obtained from the Chicago Data Portal at: https://data.cityofchicago.org/Public-Safety/Crimes-2001-to-present/ijzp-q8t2

Store the datasets in database tables
The lab requires you to have these three tables populated with a subset of the whole datasets. Download the 'ChicagoCensusData.csv', 'ChicagoPublicSchools.csv', and 'ChicagoCrimeData.csv' datasets below and load the data into your Mysql database.

- Chicago Census Data

- Chicago Public Schools

- Chicago Crime Data

In [1]:
import pandas as pd
import sqlalchemy
import mysql.connector
mydb = mysql.connector.connect(host="localhost", user="root", password="jesus", database="georgedb")
mycursor = mydb.cursor()
con=sqlalchemy.create_engine("mysql+pymysql://root:jesus@localhost:3306/georgedb")

In [2]:
crime_data=pd.read_csv('~/Downloads/ChicagoCrimeData (2).csv')
# crime_data.to_sql('CHICAGO_CRIME_DATA',con=con,if_exists='replace',index=False)

In [3]:
census_data=pd.read_csv('~/Downloads/ChicagoCensusData (2).csv')
census_data.to_sql('CHICAGO_Census_DATA',con=con,if_exists='replace',index=False)

In [4]:
chicago_publicschool_data=pd.read_csv('~/Downloads/ChicagoPublicSchools (2).csv')
chicago_publicschool_data.to_sql('Chicago_publicschool_data',con=con,if_exists='replace',index=False)

<h3>Problem 1

List the case number, type of crime and community area for all crimes in community area number 18.

In [5]:
# question 1
query="""
      SELECT cr.CASE_NUMBER, cr.PRIMARY_TYPE,cr.COMMUNITY_AREA_NUMBER,
      ce.COMMUNITY_AREA_NAME FROM chicago_crime_data cr
      INNER JOIN chicago_census_data ce 
      ON cr.COMMUNITY_AREA_NUMBER = ce.COMMUNITY_AREA_NUMBER
      WHERE cr.COMMUNITY_AREA_NUMBER = 18 """
data=pd.read_sql_query(query,con=con)
data

  CASE_NUMBER     PRIMARY_TYPE  COMMUNITY_AREA_NUMBER COMMUNITY_AREA_NAME
0    JA560123  CRIMINAL DAMAGE                   18.0          Montclaire
1    JA107722    OTHER OFFENSE                   18.0          Montclaire

<h3>Problem 2
List all crimes that took place at a school. Include case number, crime type and community name.

In [6]:
query2="""  SELECT cr.CASE_NUMBER, cr.PRIMARY_TYPE,cr.COMMUNITY_AREA_NUMBER,cr.LOCATION_DESCRIPTION,
      ce.COMMUNITY_AREA_NAME FROM georgedb.chicago_crime_data cr
      INNER JOIN chicago_census_data ce 
      ON cr.COMMUNITY_AREA_NUMBER = ce.COMMUNITY_AREA_NUMBER
      WHERE cr.LOCATION_DESCRIPTION LIKE '%SCHOOL%'"""
mycursor.execute(query2)
myresult=mycursor.fetchall()
data2=pd.DataFrame(myresult)
data2.rename(columns={0:'CASE_NUMBER',1:'CRIME TYPE',2:'COMMUNITY_AREA_NAME'})

,CASE_NUMBER,CRIME TYPE,COMMUNITY_AREA_NAME,3,4
0,HK577020,NARCOTICS,1.0,"SCHOOL, PUBLIC, GROUNDS",Rogers Park
1,HL725506,BATTERY,4.0,"SCHOOL, PUBLIC, BUILDING",Lincoln Square
2,HH639427,BATTERY,25.0,"SCHOOL, PUBLIC, BUILDING",Austin
3,HS200939,CRIMINAL DAMAGE,25.0,"SCHOOL, PUBLIC, GROUNDS",Austin
4,HT315369,ASSAULT,27.0,"SCHOOL, PUBLIC, GROUNDS",East Garfield Park
5,HP716225,BATTERY,35.0,"SCHOOL, PUBLIC, BUILDING",Douglas
6,HL353697,BATTERY,43.0,"SCHOOL, PUBLIC, GROUNDS",South Shore
7,HS305355,NARCOTICS,58.0,"SCHOOL, PUBLIC, BUILDING",Brighton Park
8,JA460432,BATTERY,70.0,"SCHOOL, PUBLIC, GROUNDS",Ashburn
9,HR585012,CRIMINAL TRESPASS,70.0,"SCHOOL, PUBLIC, GROUNDS",Ashburn

<h3>Problem 3

For the communities of Oakland, Armour Square, Edgewater and CHICAGO list the associated community_area_numbers and the case_numbers.

In [7]:
query3="""
      SELECT cr.CASE_NUMBER,cr.COMMUNITY_AREA_NUMBER,
      ce.COMMUNITY_AREA_NAME FROM georgedb.chicago_census_data ce
      LEFT JOIN chicago_crime_data cr 
      ON ce.COMMUNITY_AREA_NUMBER = cr.COMMUNITY_AREA_NUMBER
      WHERE ce.COMMUNITY_AREA_NAME IN ('Oakland','Armour Square', 'Edgewater','CHICAGO')
      UNION
      SELECT cr.CASE_NUMBER,cr.COMMUNITY_AREA_NUMBER,
            ce.COMMUNITY_AREA_NAME FROM georgedb.chicago_census_data ce
      RIGHT JOIN chicago_crime_data cr 
      ON ce.COMMUNITY_AREA_NUMBER = cr.COMMUNITY_AREA_NUMBER
      WHERE ce.COMMUNITY_AREA_NAME IN ('Oakland','Armour Square', 'Edgewater','CHICAGO')
"""
data1=pd.read_sql_query(query3,con=con)
data1

  CASE_NUMBER  COMMUNITY_AREA_NUMBER COMMUNITY_AREA_NAME
0    HV537004                   77.0           Edgewater
1    HM392612                   77.0           Edgewater
2        None                    NaN       Armour Square
3        None                    NaN             Oakland
4        None                    NaN             CHICAGO

<h3>Problem 4

<H5>Write and execute a SQL query to list the school names, community names and average attendance for communities with a hardship index of 98.<H5>

In [8]:
query=""" SELECT ps.NAME_OF_SCHOOL,ps.AVERAGE_STUDENT_ATTENDANCE,ps.COMMUNITY_AREA_NAME,
            ps.Average_Teacher_Attendance,ce.HARDSHIP_INDEX 
            FROM georgedb.chicago_publicschool_data ps
            LEFT JOIN georgedb.chicago_census_data ce 
            ON ps.COMMUNITY_AREA_NUMBER = ce.COMMUNITY_AREA_NUMBER
            WHERE ce.HARDSHIP_INDEX=98;

 """
data=pd.read_sql_query(query,con=con)
data

,NAME_OF_SCHOOL,AVERAGE_STUDENT_ATTENDANCE,COMMUNITY_AREA_NAME,Average_Teacher_Attendance,HARDSHIP_INDEX
0,George Washington Carver Military Academy High...,91.60%,RIVERDALE,96.40%,98.0
1,George Washington Carver Primary School,90.90%,RIVERDALE,94.70%,98.0
2,Ira F Aldridge Elementary School,92.90%,RIVERDALE,96.30%,98.0
3,William E B Dubois Elementary School,93.30%,RIVERDALE,94.40%,98.0